#### BuiltInFailures.GridChainSketchFailures Members

---

|  |
| --- |
| BuiltInFailures GridChainSketchFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures GridChainSketchFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ClosedLoop | GridChain sketch contains a closed loop. |
| Public property Static member | InvalidSketch | Sketch is invalid. Grid sketch must consist of a single open loop with no intersecting lines. |
| Public property Static member | MoreThanOneLoop | GridChain sketch contains more than one loop. |
| Public property Static member | OverlappingLines | GridChain sketch contains lines which overlap. |

# See Also

BuiltInFailures GridChainSketchFailures Class

Autodesk.Revit.DB Namespace